bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
#include "m61_text.hpp"
#include "mk61emu_core.h"
#include "program_store.hpp"
#include "run_measurement.hpp"
#include "terminal_core.hpp"
#include "terminal_script.hpp"

#include <cassert>
#include <cstdio>
#include <cstring>
#include <string>
#include <vector>

IK1302 m_IK1302 = {};
u8 ringM[SIZE_RING_M] = {};

struct StoredScript {
  std::string name;
  std::string source;
  u16 parent_id;
};

static std::vector<StoredScript> scripts;
static int range_reads = 0;
static int executed_commands = 0;
static int clear_count = 0;
static usize active_program_steps = core_61::CLASSIC_PROGRAM_STEP;
static core_61::Mk61ProgramBoundaryHook boundary_hook = nullptr;
static void* boundary_user_data = nullptr;
struct HostCommandHook {
  core_61::Mk61CommandHookHandle handle;
  u8 opcode;
  core_61::Mk61CommandHookPhase phase;
  core_61::Mk61CommandHook callback;
  void* user_data;
};
static std::vector<HostCommandHook> command_hooks;
static core_61::Mk61CommandHookHandle next_command_hook = 1;
static u32 command_sequence = 0;
static int context_saves = 0;
static int context_restores = 0;
static int reinit_count = 0;
static int hidden_rewind_count = 0;
static AngleUnit host_angle_unit = DEGREE;
static AngleUnit saved_context_angle = DEGREE;
static u32 fake_millis = 0;
static std::vector<std::string> executed_lines;
static std::vector<bool> executed_in_trap;
struct HostFontRule {
  std::string name;
  u16 directory;
  i32 result;
};
struct HostFontAttempt {
  std::string name;
  u16 directory;
};
static std::vector<HostFontRule> font_rules;
static std::vector<HostFontAttempt> font_attempts;
static bool font_session_active = false;
static int font_begin_count = 0;
static int font_restore_count = 0;
static int font_end_count = 0;

namespace program_store {

int count(ProgramType type) {
  return type == ProgramType::MK61 ? (int) scripts.size() : 0;
}

bool entry(ProgramType type, int index, Entry& out) {
  if(type != ProgramType::MK61 || index < 0 || index >= (int) scripts.size()) return false;
  out.type = type;
  std::strncpy(out.name, scripts[(usize) index].name.c_str(), NAME_SIZE - 1);
  out.name[NAME_SIZE - 1] = 0;
  out.data_len = (u16) scripts[(usize) index].source.size();
  out.id = (u16) index;
  out.parent_id = scripts[(usize) index].parent_id;
  out.kind = NodeKind::FILE;
  return true;
}

bool entry_by_id(u16 id, Entry& out) {
  return entry(ProgramType::MK61, id, out);
}

int child_count(u16 parent_id) {
  int result = 0;
  for(const StoredScript& script : scripts) {
    if(script.parent_id == parent_id) result++;
  }
  return result;
}

bool child(u16 parent_id, int index, Entry& out) {
  for(usize i = 0; i < scripts.size(); i++) {
    if(scripts[i].parent_id != parent_id) continue;
    if(index-- == 0) return entry(ProgramType::MK61, (int) i, out);
  }
  return false;
}

bool read_range(ProgramType type, const char* name, u16 offset, u8* data, u16 len, u16* out_len) {
  range_reads++;
  if(out_len != nullptr) *out_len = 0;
  if(type != ProgramType::MK61) return false;
  for(const StoredScript& script : scripts) {
    if(script.name != name) continue;
    if(offset >= script.source.size()) return true;
    usize available = script.source.size() - offset;
    if(available > len) available = len;
    std::memcpy(data, script.source.data() + offset, available);
    if(out_len != nullptr) *out_len = (u16) available;
    return true;
  }
  return false;
}

bool read_range_id(u16 id, u16 offset, u8* data, u16 len, u16* out_len) {
  range_reads++;
  if(out_len != nullptr) *out_len = 0;
  if(id >= scripts.size()) return false;
  const StoredScript& script = scripts[id];
  if(offset >= script.source.size()) return true;
  usize available = script.source.size() - offset;
  if(available > len) available = len;
  std::memcpy(data, script.source.data() + offset, available);
  if(out_len != nullptr) *out_len = (u16) available;
  return true;
}

} // пространство имён program_store

namespace core_61 {

usize program_steps(void) { return active_program_steps; }

void get_code_page(uint8_t* page) {
  std::memset(page, 0, CODE_PAGE_BUFFER_SIZE);
}

bool set_mk61_program_boundary_hook(Mk61ProgramBoundaryHook callback,
                                    void* user_data) {
  if(callback == nullptr || boundary_hook != nullptr) return false;
  boundary_hook = callback;
  boundary_user_data = user_data;
  return true;
}

void clear_mk61_program_boundary_hook(void) {
  boundary_hook = nullptr;
  boundary_user_data = nullptr;
}

bool program_boundary_yielded(void) { return false; }

Mk61CommandHookHandle register_mk61_command_hook(
    u8 opcode, Mk61CommandHookPhase phase, Mk61CommandHook callback,
    void* user_data) {
  if(callback == nullptr ||
     command_hooks.size() >= MK61_COMMAND_HOOK_CAPACITY) {
    return INVALID_MK61_COMMAND_HOOK;
  }
  const Mk61CommandHookHandle handle = next_command_hook++;
  command_hooks.push_back({handle, opcode, phase, callback, user_data});
  return handle;
}

bool unregister_mk61_command_hook(Mk61CommandHookHandle handle) {
  for(usize i = 0; i < command_hooks.size(); i++) {
    if(command_hooks[i].handle != handle) continue;
    command_hooks.erase(command_hooks.begin() + (isize) i);
    return true;
  }
  return false;
}

usize registered_mk61_command_hook_count(void) {
  return command_hooks.size();
}

static ContextBuffer context_buffer = {};
static ContextBufferOwner context_buffer_owner = (ContextBufferOwner) 0;

ContextBuffer* acquire_context_buffer(ContextBufferOwner owner) {
  if((u8) owner == 0 || (u8) context_buffer_owner != 0) return nullptr;
  context_buffer_owner = owner;
  return &context_buffer;
}

ContextBuffer* owned_context_buffer(ContextBufferOwner owner) {
  return (u8) owner != 0 && context_buffer_owner == owner
      ? &context_buffer : nullptr;
}

bool release_context_buffer(ContextBufferOwner owner) {
  if((u8) owner == 0 || context_buffer_owner != owner) return false;
  context_buffer_owner = (ContextBufferOwner) 0;
  return true;
}

bool save_context(ContextBuffer& out) {
  std::memset(out.bytes, 0xA5, sizeof(out.bytes));
  saved_context_angle = host_angle_unit;
  context_saves++;
  return true;
}

bool restore_context(const ContextBuffer& saved) {
  assert(saved.bytes[0] == 0xA5);
  host_angle_unit = saved_context_angle;
  context_restores++;
  return true;
}

} // пространство имён core_61

void MK61Emu_SetAngleUnit(AngleUnit angle) {
  host_angle_unit = angle;
}

AngleUnit MK61Emu_GetAngleUnit(void) {
  return host_angle_unit;
}

