bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
static void test_duplicate_and_oversized_labels_fail_before_execution(void) {
  reset_host();
  add_script("DUP", ":same\n:same\nok\n");
  assert(!m61_text::load_program("DUP"));
  m61_text::Error error = require_error();
  assert(error.line == 2);
  assert(std::strcmp(error.message, "duplicate label") == 0);
  assert(executed_commands == 0);

  reset_host();
  add_script("LONG", ":abcdefghijklmnopqrstuvwxyz123456\nok\n");
  assert(!m61_text::load_program("LONG"));
  error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "invalid label") != nullptr);
}

static void test_line_limit_is_enforced_during_indexing(void) {
  reset_host();
  add_script("LINE", std::string(terminal_core::MAX_INPUT_TEXT + 1, 'x') + "\n");
  assert(!m61_text::load_program("LINE"));
  const m61_text::Error error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "line is too long") != nullptr);
}

static void test_indexed_loop_is_budgeted_and_uses_block_reads(void) {
  reset_host();
  std::string source;
  for(int i = 0; i < 200; i++) source += "\n";
  source += ":loop\nrun :loop\n";
  add_script("LOOP", source);

  assert(m61_text::load_program("LOOP"));
  assert(m61_text::active());
  for(int i = 0; i < 32; i++) {
    const int before = executed_commands;
    m61_text::service();
    assert(executed_commands - before <= 8);
  }
  assert(executed_commands > 8);
  assert(range_reads < 200); // старому исполнителю здесь требовались тысячи однобайтовых чтений
  m61_text::cancel();
}

static void test_label_reference_rejects_trailing_tokens(void) {
  reset_host();
  add_script("ARGS", ":loop\nrun :loop extra\n");
  assert(!m61_text::load_program("ARGS"));
  const m61_text::Error error = require_error();
  assert(error.line == 2);
}

static void test_run_waits_and_reports_later_failure(void) {
  reset_host();
  add_script("WAIT", "run\nbad\n");
  assert(m61_text::load_program("WAIT"));
  assert(m61_text::active());
  assert(executed_commands == 1);

  m61_text::service();
  assert(executed_commands == 1); // калькулятор всё ещё работает
  m_IK1302.comma = 0;
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "WAIT") == 0);
  assert(error.line == 2);
}

static void test_measure_arms_next_manual_run_after_script_finishes(void) {
  reset_host();
  add_script("FACTORIAL", "measure\n");
  assert(m61_text::load_program("FACTORIAL"));
  assert(!m61_text::active());
  assert(hidden_rewind_count == 1);
  assert(run_measurement::state() == run_measurement::State::ARMED);

  assert(run_measurement::program_started(100U));
  u32 elapsed = 0;
  assert(run_measurement::program_stopped(325U, elapsed));
  assert(elapsed == 225U);
  assert(run_measurement::state() == run_measurement::State::IDLE);
}

static void test_measure_preceding_run_starts_at_the_run_boundary(void) {
  reset_host();
  fake_millis = 700U;
  add_script("AUTO", "measure\nrun\nret\n");
  assert(m61_text::load_program("AUTO"));
  assert(m61_text::active());
  assert(hidden_rewind_count == 1);
  assert(run_measurement::state() == run_measurement::State::RUNNING);

  fake_millis = 950U;
  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  u32 elapsed = 0;
  assert(run_measurement::program_stopped(fake_millis, elapsed));
  assert(elapsed == 250U);
}

static void test_measure_is_cancelled_by_new_root_error_cancel_and_reinit(void) {
  reset_host();
  add_script("ARM", "measure\n");
  add_script("PLAIN", "ok\n");
  assert(m61_text::load_program("ARM"));
  assert(run_measurement::state() == run_measurement::State::ARMED);
  assert(m61_text::load_program("PLAIN"));
  assert(run_measurement::state() == run_measurement::State::IDLE);

  assert(m61_text::load_program("ARM"));
  m61_text::cancel();
  assert(run_measurement::state() == run_measurement::State::IDLE);

  add_script("FAIL_AFTER_ARM", "measure\nbad\n");
  assert(!m61_text::load_program("FAIL_AFTER_ARM"));
  assert(run_measurement::state() == run_measurement::State::IDLE);

  add_script("REINIT_AFTER_ARM", "measure\nreinit\n");
  assert(m61_text::load_program("REINIT_AFTER_ARM"));
  assert(run_measurement::state() == run_measurement::State::IDLE);
}

static void test_print_owns_display_until_root_script_finishes(void) {
  reset_host();
  add_script("DISPLAY", "print \"frame\"\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_print_off_and_on_control_display_ownership(void) {
  reset_host();
  add_script("DISPLAY", "print off\nrun\nprint on\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(!m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_trap_wait_holds_snapshot_and_resumes_at_deadline(void) {
  reset_host();
  add_script("WAIT", "trap 10 run :frame\nrun\nret\n:frame\nprint \"frame\"\nwait 500\nret\n");
  assert(m61_text::load_program("WAIT"));
  assert(fire_program_boundary(10, 0x02));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(m61_text::display_owned());
  assert(context_saves == 1);
  assert(context_restores == 0);

  fake_millis = 499;
  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(context_restores == 0);

  fake_millis = 500;
  m61_text::service();
  assert(!m61_text::calculator_suspended());
  assert(context_restores == 1);
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_trap_ret_preserves_user_angle_change(void) {
  reset_host();
  add_script("ANGLE",
             "trap 10 run :frame\n"
             "run\n"
             "ret\n"
             ":frame\n"
             "wait 500\n"
             "ret\n");
  MK61Emu_SetAngleUnit(DEGREE);
  assert(m61_text::load_program("ANGLE"));
  assert(fire_program_boundary(10));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(MK61Emu_GetAngleUnit() == DEGREE);

